README.org
#+title: Simsched
#+STARTUP: noinlineimages
#+STARTUP: hideblocks
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :tangle ./simsched.el :mkdirp yes

To better adhere to the advice in /Deep Work/, create a simple system to approximate every minute of my schedule.

* TODO
** Configure emacs 'group' for simsched customs
** Remove dependencies on load!
** Retain only required dependencies from utils files

* Rationale
Simsched is a (sim)ple (sched)uling emacs-lisp program designed to conform to the scheduling philosophy presented by Cal Newport in his book "Deep Work".

The following excerpt can be found in /Part 2: The rules, Rule #4: Drain the Shallows, Schedule Every Minute of Your Day/, emphasis mine.

#+begin_quote
Here's my suggestion: At the beginning of each workday, turn to a new page of lined paper in a notebook that you dedicate to this purpose.
*Down the left-hand side of the page, mark every other line with an hour of the day*, covering the full set of hours you typically work.
Now comes the important part: Divide the hours of your workday into /blocks/ and assign activities to the blocks.
For example, you might block off nine a.m. to eleven a.m. for writing a client's press release.
To do so, actually *draw a box that covers the lines corresponding to these hours, then write "press release" inside the box*.
Not every block need be dedicated to a work task.
There might be time blocks for lunch or relaxation breaks.
To keep things reasonable clean, *the minimum length of a block should be thirty minutes* (i.e., one line on your page).
This means, for example, that instead of having a unique small box for each small task on your plate for the day —
/respond to boss's email, submit reimbursement form, ask Carl about report/ — you can batch similar things into more generic /task blocks/...

*When you're done scheduling your day, every minute should be part of a block*.
You have, in effect, given every minute of your workday a job.
Now as you go through your day, use this schedule to guide you...

Two things can (and likely will) go wrong with your schedule once the day progresses.
The first is that *your estimates will prove wrong*...
The second problem is that *you'll be interupted and new obligations will unexpectedly appear on your plate*.
These events will also break your schedule.

This is okay.
If your schedule is disrupted, you should, at the next available moment, take a few minutes to create a revised schedule for the time that remains in the day...
*Cross out the blocks for the remainder of the day and create new blocks to the right of the old ones* on the page
(I draw my boxes skinny so I have room for several revisions).
On some days, you might rewrite your schedule half a dozen times.
Don't despair if this happens. *Your goal is not to stick to a given schedule at all costs*;
it's instead to maintain, at all times, a thoughtful say in what you're doing with your time going forward —
even if these decisions are reworked again and again as the day unfolds.
#+end_quote

I've emphasized the key pieces of procedure and philosophy which underlie this scheduling program.
I find this way of scheduling to be much more effective than some other, more fine-grained approaches, characteristic of more complex and flexible software (such as the agenda built-in to org mode).
I want to simply be aware of the macro-level objectives I have throughout the day, and track their evolution.
I find that the more detail I put into a schedule, the more time I spend curating it, and the less it actually reflects my daily activities.
The same philosophy is echoed in David Allen's /Getting Things Done/.

The rest of this document is the entirety of the /simsched/ program, written in a [[http://literateprogramming.com/][literate]] style.

* Using Simsched
To use this program, you can simply download the included =simsched.el= file from this repository and =load= it into your emacs.
Alternatively, if you would like to modify the software, you can download this org file and tangle (with =org-babel-tangle=) it yourself.

* Format
Entries will be a newline separated list of entries, where an Entry is defined as
#+begin_example
Entry | TimeRange Objective

TimeRange | Time-Time

Time | [0-9]
     | 1[0|1|2]
     | [0-9]:[0|3]0
     | 1[0|1|2]:[0|3]0

Objective | .*
#+end_example

for example

#+begin_example
9-9:30 objective
11:30-2 This objective has a longer (single-line) description
#+end_example

These entries can be used in plaintext files, source code, markdown, org-mode headers, items, sub-items, etc.
As long as there is only a single new-line separating them, the format holds.

** Capturing Times on a Line

#+begin_src emacs-lisp
(defun simsched/parse-time-range-entry ()
  "Return the start time, end time, and subsequent text listed on a given line, if they exist."
  (let* (
         (time-regex "\\([[:digit:]][[:digit:]]?:[[:digit:]][[:digit:]]\\|[[:digit:]][[:digit:]]?\\)")
         (range-regex (concat time-regex "-" time-regex))
         (whole-range nil)
         (start-time nil)
         (end-time nil))
    (condition-case nil
        (progn
          (beginning-of-line)
          (re-search-forward range-regex (point-at-eol))
          (setq whole-range (split-string (match-string 0) "-"))
          (setq start-time (first whole-range))
          (setq end-time (second whole-range))

          ;; reset the point to be at the end of the time range to get the event name
          (beginning-of-line)
          (re-search-forward "-" (point-at-eol))
          (re-search-forward " " (point-at-eol))
          (list start-time end-time (buffer-substring-no-properties (match-end 0) (point-at-eol))))
      (error nil))))
#+end_src

** Capturing All Times for a Schedule Block

#+begin_src emacs-lisp
(defun simsched/parse-schedule ()
  "Expand region above and below current line to discover
   all lines parseable as time ranges"
  (let ((begin (point-at-bol))
        (ranges-here-to-end '())
        (ranges-beginning-to-here '())
        (current-range (simsched/parse-time-range-entry)))
    (if (not current-range)
        (message "Point not inside a valid simple schedule.")
      (save-excursion
        (while current-range
          (push current-range ranges-here-to-end)
          (forward-line 1)
          (setq current-range (simsched/parse-time-range-entry)))

        (goto-char begin)
        (forward-line -1)
        (setq current-range (simsched/parse-time-range-entry))

        (while current-range
          (push current-range ranges-beginning-to-here)
          (forward-line -1)
          (setq current-range (simsched/parse-time-range-entry)))
        (append ranges-beginning-to-here (reverse ranges-here-to-end))))))
#+end_src

try running =(simsched/parse-schedule)= on the example below

#+begin_example
9-9:30 meeting
9:30-10:30 meeting 2
10:00-11 unexpected thing
10:30-11:30 unexpected thing 2
12:00-1 unexpected thing 3
#+end_example

** Pretty-printing
To pretty-print each time range entry, we can use [[https://github.com/rolandwalker/unicode-enbox][unicode-enbox]] (and its dependencies)
#+begin_src emacs-lisp
(load! "./unicode-enbox.el")
(load! "./ucs-utils.el")
(load! "./string-utils.el")
(load! "./list-utils.el")
(load! "./obarray-fns.el")
#+end_src

Try running the below code to see the effect
#+begin_example
(insert (unicode-enbox "Test"))
#+end_example

#+begin_example
┌────┐
│Test│
└────┘
#+end_example

* Scheduling

** Normalizing Times
Because our format is flexible - allowing for both simple times (like =1=) and long-form times (like =1:00=),
we must normalize all times for a consistent representation within our program.

#+begin_src emacs-lisp
;; Assign synonymous times (1 and 1:00) with the same values, 1 representing A.M., the other P.M.
(setq simsched/normalize-time
      #s(hash-table
         size 24
         test equal
         data (
               "1:00"  (1 25)
               "1"     (1 25)
               "1:30"  (2 26)

               "2:00"  (3 27)
               "2"     (3 27)
               "2:30"  (4 28)

               "3:00"  (5 29)
               "3"     (5 29)
               "3:30"  (6 30)

               "4:00"  (7 31)
               "4"     (7 31)
               "4:30"  (8 32)

               "5:00"  (9 33)
               "5"     (9 33)
               "5:30"  (10 34)

               "6:00"  (11 35)
               "6"     (11 35)
               "6:30"  (12 36)

               "7:00"  (13 37)
               "7"     (13 37)
               "7:30"  (14 38)

               "8:00"  (15 39)
               "8"     (15 39)
               "8:30"  (16 40)

               "9:00"  (17 41)
               "9"     (17 41)
               "9:30"  (18 42)

               "10:00" (19 43)
               "10"    (19 43)
               "10:30" (20 44)

               "11:00" (21 45)
               "11"    (21 45)
               "11:30" (22 46)

               "12:00" (23 47)
               "12"    (23 47)
               "12:30" (24 48))))

;; When denormalizing times, always use the long form (1:00)
(setq simsched/denormalize-time
      #s(hash-table
         size 48
         test equal
         data (
               1  "1:00"
               25 "1:00"
               2  "1:30"
               26 "1:30"

               3  "2:00"
               27 "2:00"
               4  "2:30"
               28 "2:30"

               5  "3:00"
               29 "3:00"
               6  "3:30"
               30 "3:30"

               7  "4:00"
               31 "4:00"
               8  "4:30"
               32 "4:30"

               9  "5:00"
               33 "5:00"
               10  "5:30"
               34 "5:30"

               11  "6:00"
               35 "6:00"
               12  "6:30"
               36 "6:30"

               13  "7:00"
               37 "7:00"
               14  "7:30"
               38 "7:30"

               15  "8:00"
               39 "8:00"
               16  "8:30"
               40 "8:30"

               17  "9:00"
               41 "9:00"
               18  "9:30"
               42 "9:30"

               19  "10:00"
               43 "10:00"
               20  "10:30"
               44 "10:30"

               21  "11:00"
               45 "11:00"
               22  "11:30"
               46 "11:30"

               23  "12:00"
               47 "12:00"
               24  "12:30"
               48 "12:30")))

(defun simsched/normalize-schedule (schedule)
  (mapcar (lambda (time-range-entry)
            (list
             (gethash (first time-range-entry) simsched/normalize-time)
             (gethash (second time-range-entry) simsched/normalize-time)
             (third time-range-entry)))
          schedule))
#+end_src

