simsched.el
(defun simsched/parse-time-range-entry ()
  "Return the start time, end time, and subsequent text listed on a given line, if they exist."
  (let* (
         (time-regex "\\([[:digit:]][[:digit:]]?:[[:digit:]][[:digit:]]\\|[[:digit:]][[:digit:]]?\\)")
         (range-regex (concat time-regex "-" time-regex))
         (whole-range nil)
         (start-time nil)
         (end-time nil))
    (condition-case nil
        (progn
          (beginning-of-line)
          (re-search-forward range-regex (point-at-eol))
          (setq whole-range (split-string (match-string 0) "-"))
          (setq start-time (first whole-range))
          (setq end-time (second whole-range))

          ;; reset the point to be at the end of the time range to get the event name
          (beginning-of-line)
          (re-search-forward "-" (point-at-eol))
          (re-search-forward " " (point-at-eol))
          (list start-time end-time (buffer-substring-no-properties (match-end 0) (point-at-eol))))
      (error nil))))

(defun simsched/parse-schedule ()
  "Expand region above and below current line to discover
   all lines parseable as time ranges"
  (let ((begin (point-at-bol))
        (ranges-here-to-end '())
        (ranges-beginning-to-here '())
        (current-range (simsched/parse-time-range-entry)))
    (if (not current-range)
        (message "Point not inside a valid simple schedule.")
      (save-excursion
        (while current-range
          (push current-range ranges-here-to-end)
          (forward-line 1)
          (setq current-range (simsched/parse-time-range-entry)))

        (goto-char begin)
        (forward-line -1)
        (setq current-range (simsched/parse-time-range-entry))

        (while current-range
          (push current-range ranges-beginning-to-here)
          (forward-line -1)
          (setq current-range (simsched/parse-time-range-entry)))
        (append ranges-beginning-to-here (reverse ranges-here-to-end))))))

(load! "./unicode-enbox.el")
(load! "./ucs-utils.el")
(load! "./string-utils.el")
(load! "./list-utils.el")
(load! "./obarray-fns.el")

;; Assign synonymous times (1 and 1:00) with the same values, 1 representing A.M., the other P.M.
(setq simsched/normalize-time
      #s(hash-table
         size 24
         test equal
         data (
               "1:00"  (1 25)
               "1"     (1 25)
               "1:30"  (2 26)

               "2:00"  (3 27)
               "2"     (3 27)
               "2:30"  (4 28)

               "3:00"  (5 29)
               "3"     (5 29)
               "3:30"  (6 30)

               "4:00"  (7 31)
               "4"     (7 31)
               "4:30"  (8 32)

               "5:00"  (9 33)
               "5"     (9 33)
               "5:30"  (10 34)

               "6:00"  (11 35)
               "6"     (11 35)
               "6:30"  (12 36)

               "7:00"  (13 37)
               "7"     (13 37)
               "7:30"  (14 38)

               "8:00"  (15 39)
               "8"     (15 39)
               "8:30"  (16 40)

               "9:00"  (17 41)
               "9"     (17 41)
               "9:30"  (18 42)

               "10:00" (19 43)
               "10"    (19 43)
               "10:30" (20 44)

               "11:00" (21 45)
               "11"    (21 45)
               "11:30" (22 46)

               "12:00" (23 47)
               "12"    (23 47)
               "12:30" (24 48))))

;; When denormalizing times, always use the long form (1:00)
(setq simsched/denormalize-time
      #s(hash-table
         size 48
         test equal
         data (
               1  "1:00"
               25 "1:00"
               2  "1:30"
               26 "1:30"

               3  "2:00"
               27 "2:00"
               4  "2:30"
               28 "2:30"

               5  "3:00"
               29 "3:00"
               6  "3:30"
               30 "3:30"

               7  "4:00"
               31 "4:00"
               8  "4:30"
               32 "4:30"

               9  "5:00"
               33 "5:00"
               10  "5:30"
               34 "5:30"

               11  "6:00"
               35 "6:00"
               12  "6:30"
               36 "6:30"

               13  "7:00"
               37 "7:00"
               14  "7:30"
               38 "7:30"

               15  "8:00"
               39 "8:00"
               16  "8:30"
               40 "8:30"

               17  "9:00"
               41 "9:00"
               18  "9:30"
               42 "9:30"

               19  "10:00"
               43 "10:00"
               20  "10:30"
               44 "10:30"

               21  "11:00"
               45 "11:00"
               22  "11:30"
               46 "11:30"

               23  "12:00"
               47 "12:00"
               24  "12:30"
               48 "12:30")))

(defun simsched/normalize-schedule (schedule)
  (mapcar (lambda (time-range-entry)
            (list
             (gethash (first time-range-entry) simsched/normalize-time)
             (gethash (second time-range-entry) simsched/normalize-time)
             (third time-range-entry)))
          schedule))
