README.org
** Conflicts
But how will our program know whether the user means =1:00 A.M.= or =1:00 P.M.= if we only require them to enter =1=?
*We will have to truncate the schedule to 12 hours only.*

Consider the following example:

#+begin_example
9:00-10:00 first thing
10:00-8:00 super super long thing
8:00-10:00 supposed to be after the last thing
#+end_example

If we allow 24 hours, our schedule will not be able to figure out if the third entry conflicts with the first, or if it comes after the second.
We could require the user to enter a more descriptive format, and provide utility functions for doing so, but I am not willing to compromise on
the simplicity of the format. I just want to be able to super quickly jot down entries and render the schedule.

So instead, we will define our schedule to have a maximum of 12 hours, starting with an hour configurable by the user.
This way, we will disambiguate the case above - it will conflict with the first entry.

#+begin_src emacs-lisp
(defcustom simsched/start-time "7:00"
  "First hour of the 12-hour schedule"
  :type 'string
  :options '("1:00" "2:00" "3:00" "4:00" "5:00" "6:00" "7:00" "8:00" "9:00" "10:00" "11:00" "12:00"))
#+end_src

With this custom variable in place, we can disambiguate cases like the above (The last entry will conflict with the first now).

#+begin_src emacs-lisp
(defun simsched/normalize-schedule-to-start-time (schedule)
  "Normalize all time ranges and return the proper times given the user's customized start time."
  (let ((custom-start (first (gethash simsched/start-time simsched/normalize-time)))
        (result (list))
        (am? t))
    (dolist (range schedule (reverse result))
      (let* ((normalized-start (gethash (first range)  simsched/normalize-time))
            (normalized-end   (gethash (second range) simsched/normalize-time))
            (am-start (first normalized-start))
            (pm-start (second normalized-start))
            (am-end (first normalized-end))
            (pm-end (second normalized-end))
            (should-start-am? (<= custom-start am-start))
            (should-still-be-am? (<= (if should-start-am? am-start pm-start) am-end))
            (normalized-range (list (third range))))
        (progn
          (if should-still-be-am? (push am-end normalized-range) (push pm-end normalized-range))
          (if should-start-am? (push am-start normalized-range) (push pm-start normalized-range))
          (push normalized-range result))))))
#+end_src

** Column Membership
Once we have a parsed schedule, we need to decide how to place each time-range entry
onto the formatted page.
*** Arrays

Let's begin by creating a grid representing =(hour, task)=

#+begin_src emacs-lisp
;; Decide our schedule should have max 8 columns.
;; Any more, and why do you have so many conflicts during the day?
(defvar simsched/MAX-COLUMNS 8)

(defun simsched/create-schedule-grid (schedule)
  (let ((grid (let ((grid_ (make-vector 48 nil)))
                (dotimes (i 48) (aset grid_ i (make-vector simsched/MAX-COLUMNS nil)))
                grid_)))
    (-each (simsched/normalize-schedule-to-start-time schedule) (lambda (range) (simsched/add-time-range-to-grid range grid)))
    grid))

(defun simsched/add-time-range-to-grid (range grid)
  "put range into the grid, inserting something to represent it"
  (let* ((start-time (first range))
         (end-time  (second range))
         (column (let ((look-at start-time)
                       (max-column 0))
                   (while (< look-at end-time)
                     (when (aref (aref grid look-at) max-column)
                       (progn (setq look-at start-time) (cl-incf max-column)))
                     (cl-incf look-at))
                   max-column)))
    (while (< start-time end-time)
      (aset (aref grid start-time) column (third range))
      (cl-incf start-time))))

(setq simsched/test-schedule '(("9" "9:30" "first")("10:00" "11:00" "second")("10:30" "11:30" "conflict")("11:30" "1" "another thing until afternoon")("2:00" "4" "one more in afternoon")))
(setq simsched/test-schedule2 '(("7" "9:30" "first")("1:30" "8" "another thing until afternoon")("6:00" "8" "one more in afternoon")))
#+end_src

* Making a Dedicated Buffer
We want to render the grid consistently in the same buffer, and reuse it whenever possible.
This is a similar strategy to other emacs programs.

We will allow the user to customize the buffer name and function used to switch to that buffer (in case the user wants the buffer in a certain window, new-frame, etc.)

#+begin_src emacs-lisp
(defcustom simsched/schedule-buffer-name "*simsched schedule*"
  "The default name of the buffer where the rendered schedule is displayed"
  :type 'string)

(defcustom simsched/switch-buffer-function
  #'pop-to-buffer
  "Function called to display the schedule buffer."
  :type 'function)

(defun simsched/get-create-schedule-buffer ()
  (get-buffer-create simsched/schedule-buffer-name))

(defun simsched/switch-to-schedule-buffer ()
  (interactive)
  (funcall simsched/switch-buffer-function (simsched/get-create-schedule-buffer)))
#+end_src

* Rendering a schedule

Ultimately, we want the schedule to look like this

#+begin_example
11:00┌────────┐
     │        │
11:30│some    │
     │task    │
12:00│here    │
     │        │
12:30└────────┘

 1:00┌────────┐
     │        │
 1:30│        │
     │ Some   │
 2:00│ other  │
     │ task   │
 2:30│ here   │
     │        │
 3:00└────────┘
#+end_example

Breaking it down step-wise, we get the following procedures:

** Render the Time Labels
#+begin_src emacs-lisp
(defun simsched/render-time-labels ()
  "Place time labels in the simsched buffer.
   Assumes the buffer is empty."
  (with-current-buffer (simsched/get-create-schedule-buffer)
    (dotimes (n 48)
      (let* ((time-string (gethash (1+ n) simsched/denormalize-time))
             ;; hacky, better to align w/ regexp but I can't find appropriate elisp function
             (aligned-time-string (if (< (length time-string) 5) (concat " " time-string) time-string)))
        (insert aligned-time-string)
        (insert "\n")
        (insert "\n")))))
#+end_src

** Determine the Duration of a Task

#+begin_src emacs-lisp
(defun simsched/range-span (schedule-grid row column)
  "Return the span (number of matching rows) that the item at row,column occupies.

   e.g. An item that lasts 30 minutes will have a span of 1
        An item that lasts 90 minutes will have a span of 3"
  (let ((task-at-time (aref (aref schedule-grid row) column))
        (bottom-row row)
        (top-row row))
    (while (and task-at-time (equal (aref (aref schedule-grid bottom-row) column) task-at-time))
      (setq bottom-row (1+ bottom-row)))
    (while (and task-at-time (equal (aref (aref schedule-grid top-row) column) task-at-time))
      (setq top-row (1- top-row)))
    (if (not task-at-time) 1
      (+ (- row top-row 1)
         (- bottom-row row)))))
#+end_src

** Fit Tasks into Smallest-width Boxes Possible

#+begin_src emacs-lisp
(defun simsched/justify-entry (text max-width span)
  "Try to split long entries so that they take the minimum horizontal space required.
   max-width is a suggestion that `fill-region` will try to match without breaking words.
   span is the total number of lines that the entry should fill after justification.

   e.g. if max-width is 7 but the word is antidisestablishmentarianism, fill-region will not
        break that word to 7 character chunks."
  (with-temp-buffer
    (insert text)
    (setq fill-column max-width)
    (fill-region (point-min) (point-max))
    (let* ((lines (count-lines (point-min) (point-max)))
           (newlines-above (floor (/ (- span lines) 2.0)))
           (newlines-below (ceiling (/ (- span lines) 2.0))))
      (goto-char (point-min))
      (dotimes (_ newlines-above) (insert " \n"))
      (goto-char (point-max))
      (dotimes (_ newlines-below) (insert "\n "))
      (buffer-string))))
#+end_src

