simsched.el

(defun simsched/insert-time-at-junction (string-to-insert)
  "When two time ranges share end/start time, a new special character must be used
   to concatenate the two schedule boxes."
    (let ((line-replacement (replace-regexp-in-string "┘" "┤"
                                                      (replace-regexp-in-string "└" "├"
                                                                                (or (thing-at-point 'line t) "")))))
      (beginning-of-line)
      (unless (eobp) (kill-line))
      (insert line-replacement)
      (beginning-of-line)
      (insert-rectangle (cdr string-to-insert))))


(defun simsched/render-schedule (schedule-grid)
  "Display the given (normalized) schedule grid in the simsched schedule buffer"
  (let ((column 0))
    (with-current-buffer (simsched/get-create-schedule-buffer)
      (erase-buffer)
      (simsched/render-time-labels)
      (while (< column simsched/MAX-COLUMNS)
        (let* ((max-width (cl-reduce #'max
                                  (mapcar (lambda (n)
                                            (let* ((task-at-time (aref (aref schedule-grid n) column))
                                                   (length-of-entry (length task-at-time))
                                                   (span (simsched/range-span schedule-grid n column)))
                                              (/ length-of-entry (- (1+ (* span 2)) 2))))
                                          (number-sequence 0 47))))
               (enboxed-tasks (with-temp-buffer
                                (let ((i 0)
                                      (special-delimiter "s%!r!")) ; need a short special delimiter to not mess up the boxing width
                                  (while (< i 48)
                                    (let* ((span (simsched/range-span schedule-grid i column))
                                           (task-at-time (aref (aref schedule-grid i) column))
                                           (string-to-insert (if task-at-time (simsched/justify-entry task-at-time max-width (- (1+ (* span 2)) 2)) "\n")))
                                      (insert string-to-insert)
                                      (insert "\n")
                                      (insert special-delimiter)
                                      (insert "\n")
                                      (matt/pad-lines-to-max-length)
                                      (setq i (1+ i))))
                                  (mapcar (lambda (entry) (if (string-match "[^\s\n]" entry) (unicode-enbox entry nil 'append 'append)))
                                          (split-string (buffer-string) (concat "\n" special-delimiter "\s*" "\n"))))))
               (rendered-column (with-temp-buffer
                                  (let ((i 0))
                                    (dotimes (i 48) (insert "\n"))
                                    (while (< i 48)
                                      (let* ((span (simsched/range-span schedule-grid i column))
                                             (task-at-time (aref (aref schedule-grid i) column))
                                             (string-to-insert (if task-at-time (split-string (nth i enboxed-tasks) "\n") (list ""))))
                                        (goto-line (1- (* i 2)))
                                        (end-of-line)
                                        (if (and task-at-time (char-equal (or (char-before) ?a) ?┘))
                                            (simsched/insert-time-at-junction string-to-insert)
                                          (insert-rectangle string-to-insert))
                                        (setq i (+ i span))))
                                    (split-string (buffer-string) "\n")))))
          (goto-char (point-min))
          (end-of-line)
          (insert-rectangle rendered-column)
          (matt/pad-lines-to-max-length)
          (setq column (+ column 1))))
      (simsched/trim-schedule)))
  (call-interactively #'simsched/switch-to-schedule-buffer))


(setq simsched/test-grid (simsched/create-schedule-grid simsched/test-schedule))

(defun simsched/trim-schedule ()
  "Remove schedule lines that don't have any items rendered."
  (let ((beginning-found nil)
        (end-found nil))
    (goto-char (point-min))
    (while (not beginning-found)
      (if (not (string-match "\u250c" (or (thing-at-point 'line t) ""))) ; top-left corner char
          (kill-region (point-at-bol) (1+ (point-at-eol)))
        (setq beginning-found t)))
    (goto-char (point-max))
    (while (not end-found)
      (if (not (string-match "\u2514" (or (thing-at-point 'line t) ""))) ; bottom-left corner char
          (kill-region (1- (point-at-bol)) (point-at-eol))
        (setq end-found t)))))

(defun simsched-for-region-around-point ()
  "Parse and render a simple schedule view for the schedule the point is within.

  The schedule region is a series of newline-separated Entries, where an Entry conforms to:


  Entry | TimeRange Objective

  TimeRange | Time-Time

  Time | [0-9]
       | 1[0|1|2]
       | [0-9]:[0|3]0
       | 1[0|1|2]:[0|3]0

  Objective | .*
 "
  (interactive)
  (simsched/render-schedule (simsched/create-schedule-grid (simsched/parse-schedule))))
